# Dockerfile

# --- Этап 1: Базовый образ ---
# Используем легкий образ с Python 3.11
FROM python:3.11-slim

# --- Этап 2: Настройка рабочей директории ---
WORKDIR /app

# --- Этап 3: Установка зависимостей ---
# Копируем файл зависимостей (убедитесь, что в нем есть asyncpg и python-dotenv!)
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# --- Этап 4: Копирование кода ---
# Копируем весь остальной код проекта в контейнер
COPY . .

# --- Этап 5: Настройка порта и запуск ---
# Порт, который слушает Uvicorn внутри контейнера
ENV PORT 8000
EXPOSE 8000

# Команда, которая запускается при старте контейнера
# Она запускает main.py, который создает таблицы в PostgreSQL (create_db_tables)
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]